[{"class":"pl.dworld.degree33.Speaker","id":51,"bio":"Trainer and consultant at Bottega IT Solutions. An ex-ThoughtWorker. Enthusiast of improvised acting, applied psychology, neuroscience, and it’s application in the context of software development.","firstName":"Paweł","lastName":"Badeński","photoLink":"PawelBadenski.jpg","priority":100,"shortBio":null,"talks":[{"class":"Talk","id":44}]},{"class":"pl.dworld.degree33.Speaker","id":53,"bio":"Jim is a committer on Jython, for which he has worked on nearly every aspect from compilation to Unicode, and a co-author of the Definitive Guide to Jython. Jim is a senior software developer at Rackspace, where he works at the intersection of big data and cloud computing. He is also a lecturer in computer science at the University of Colorado at Boulder, where he teaches Principles of Programming Languages. He is a graduate of Harvard College and Brown University and is a nominated member of the Python Software Foundation.","firstName":"Jim","lastName":"Baker","photoLink":"","priority":100,"shortBio":null,"talks":[{"class":"Talk","id":41}]},{"class":"pl.dworld.degree33.Speaker","id":70,"bio":"Programista Java, Freelancer. Konsultant w firmie HyperSquare Polska. Od kilku lat zajmuje się tworzeniem aplikacji na system Android. Interesuje się wszystkim co związane z androidem łącznie z projektowaniem UX. Brał udział w kilkudziesięciu projektach tworzenia aplikacji na system Android w Polsce i za granicą. W wolnych chwilach słucha muzyki oraz gra w pokera.","firstName":"Adam","lastName":"Banyś","photoLink":"AdamBanys.jpg","priority":100,"shortBio":null,"talks":[{"class":"Talk","id":96}]},{"class":"pl.dworld.degree33.Speaker","id":61,"bio":"Inżynier oprogramowania w firmie e-point SA, gdzie od pięciu lat zajmuje się projektowaniem i implementacją systemów internetowych w technologii JEE. Aktualnie związany również ze startupem działającym w obszarze usług SaaS dla urządzeń mobilnych, gdzie każdego dnia popełnia błędy, poszukując skalowalnego modelu biznesowego.\r\nJego zainteresowania zawodowe obracają się wokół platformy JEE, dobrych praktyk programistycznych, programowania funkcyjnego oraz mobilnych systemów www. Hołduje przysłowiu \"Umysł jest jak spadochron. Nie działa, jeśli nie jest szeroko otwarty\". W pracy poszukuje technologii, które rozwiązują rzeczywiste problemy natury biznesowej, a nie są jedynie lekarstwem na bolączki innych technologii.","firstName":"Łukasz","lastName":"Baran","photoLink":"LukaszBaran.jpg","priority":100,"shortBio":null,"talks":[{"class":"Talk","id":82}]},{"class":"pl.dworld.degree33.Speaker","id":66,"bio":"Tomasz Barański is a software developer working in Kraków for IBM T.J. Watson Research on projects related to High-Performance computing. He has got over 12 years experience in enterprise world, taking roles of a developer, tester, interaction designer and a go-to guy.","firstName":"Tomasz","lastName":"Barański","photoLink":"TomaszBaranski.jpg","priority":100,"shortBio":null,"talks":[{"class":"Talk","id":92}]},{"class":"pl.dworld.degree33.Speaker","id":81,"bio":"Maciek is a theoretical computer science student at the Jagiellonian University in Kraków and a web developer working in the IBM Kraków Software Laboratory. He's an active Eclipse Orion committer and JazzHub developer mainly focused on open technology integrations. His research interests include functional and logic programming.","firstName":"Maciej","lastName":"Bendkowski","photoLink":"","priority":100,"shortBio":null,"talks":[{"class":"Talk","id":105}]},{"class":"pl.dworld.degree33.Speaker","id":7,"bio":"Consultant and author Adam Bien (adam-bien.com) is an Expert Group member for the Java EE 6 / 7, EJB 3.X, JAX-RS and JPA 2.X JSRs. He has worked with Java technology since JDK 1.0 and with Servlets/EJB 1.0 and is now an architect and developer for Java SE and Java EE projects. He has edited several books about JavaFX, J2EE, and Java EE, and he is the author of Real World Java EE Patterns—Rethinking Best Practices and Real World Java EE Night Hacks (http://press.adam-bien.com). Adam is also a Java Champion, Top Java Ambassador 2012, and JavaOne 2009, 2011 Rock Star and frequently delivers Java EE workshops at Munich airport: http://airhacks.com.","firstName":"Adam","lastName":"Bien","photoLink":"AdamBien.jpg","priority":40,"shortBio":"Java EE guru","talks":[{"class":"Talk","id":13}]},{"class":"pl.dworld.degree33.Speaker","id":65,"bio":"zymon is a developer in Open Source Orion project and the Web IDE within Jazzhub. He leads a team working on Orion integrations with source controls and runtimes. His goal is to make web-based development tools match and exceed the capabilities of a desktop.\r\nSzymon is also an organizer of Eclipse Demo Camps, Eclipse Days and speaker at conferences like EclipseCon, JDD and 33rd Degree.","firstName":"Szymon","lastName":"Brandys","photoLink":"SzymonBrandys.jpg","priority":100,"shortBio":null,"talks":[]},{"class":"pl.dworld.degree33.Speaker","id":43,"bio":"Piotr Bucki - CTO i łowca talentów w firmie j-labs. 14 lat doświadczenia zawodowego. 7 lat pracy jako developer Java, następnie technical leader i konsultant w zakresie bezpieczeństwa oraz 4 lata obserwowania branży jako CTO i współwłaściciel firmy pozwalają Piotrowi doskonale wyważyć proporcje między oczekiwaniami świata technologii i biznesu. Zainteresowania zawodowe Piotra krążą wokół bezpieczeństwa systemów informatycznych – szczególnie webowych (posiadacz certyfikatu ISC2 CISSP), a prywatne – kolarstwa górskiego.","firstName":"Piotr","lastName":"Bucki","photoLink":"","priority":100,"shortBio":null,"talks":[{"class":"Talk","id":56}]},{"class":"pl.dworld.degree33.Speaker","id":85,"bio":"Tom is a real geek! He has a vast experience in messaging systems, business process management and high-throughput processing. For the last few years he has been working on numerous assignments fulfilling a range of roles, particularly dealing with design and development of small to large scale systems, mostly on the JVM. Tom is the founder of soap-ws and p2-maven-plugin open-source projects. Finally, he is very keen on tutoring, presenting and live coding, especially in a non-fluffy way. He has already presented at Jazoon, Devoxx UK, GeeCON, jDays, SoftShake or 33degree.","firstName":"Tom","lastName":"Bujok","photoLink":"TomBujok.jpg","priority":100,"shortBio":null,"talks":[{"class":"Talk","id":110}]},{"class":"pl.dworld.degree33.Speaker","id":52,"bio":"Chris Chedgey is a founder of Structure101. He has an MSc. in Computer Science from Trinity College Dublin and 28 years of experience in commercial software development, notably on large military and aerospace projects in Canada, including 5 years on the International Space Station Program. He is a strong advocate for the principles of modularity above the class level, and has spoken at dozens of Java and .NET User Group meetings in Europe and the US, and conferences including JFall (Netherlands), WICSA (Finland), Oredev (Sweden), Gearconf (Germany), JavaOne South America (Brazil).\r\n","firstName":"Chris","lastName":"Chedgey","photoLink":"ChrisChedgey.jpg","priority":100,"shortBio":null,"talks":[{"class":"Talk","id":43}]},{"class":"pl.dworld.degree33.Speaker","id":35,"bio":"David Delabassee is a software evangelist working for Oracle. Prior to Oracle, David spent a decade at Sun Microsystems focusing on Java end-to-end (from the smart card to the high end server), related technologies and the developer tools. In his various roles, David has been involved in numerous Java projects since the early days of this technology. David lives in Belgium and in his spare time, he enjoy tinkering and playing with technologies such as Java, Arduino, Linux, Home Automation, etc. You can follow David on Twitter under @delabassee","firstName":"David","lastName":"Delabassee","photoLink":"DavidDelabassee.jpg","priority":100,"shortBio":null,"talks":[{"class":"Talk","id":64}]},{"class":"pl.dworld.degree33.Speaker","id":40,"bio":"Daniel Deogun is currently a senior consultant at Omegapoint in Stockholm. He's been in the industry for 11 years and was an early adopter of TDD, BDD, and DDD. Daniel's assignments often involve mentoring and helping clients to improve the overall quality and reliability of their codebase. Lately, Daniel has focused on building high performant systems with Akka.","firstName":"Daniel","lastName":"Deogun","photoLink":"DanielDeogun.jpg","priority":100,"shortBio":null,"talks":[]},{"class":"pl.dworld.degree33.Speaker","id":87,"bio":"Technical enthusiast, software engineer and product owner of Service Bootstrap developed in Allegro . \r\nGained software experience in the biggest polish web companies – Onet.pl and Allegro.pl. \r\nHe has a lot of experience in designing and building modern, scalable web systems. \r\nHe is open to all new technologies an programming languages and he has no fear to work on legacy systems and rewrite it in modern way. ","firstName":"Krzysztof","lastName":"Dębski","photoLink":"KrzysztofDebski.jpg","priority":100,"shortBio":null,"talks":[{"class":"Talk","id":111}]},{"class":"pl.dworld.degree33.Speaker","id":21,"bio":"I am the founder and CEO of Data Geekery GmbH, located in Zurich, Switzerland. With my company I have been selling database products and services around Java and SQL since 2013. Ever since my Master's studies at EPFL in 2006, I have been fascinated by the interaction of Java and SQL. Most of this experience I have obtained in the Swiss E-Banking field through various variants (JDBC, Hibernate, mostly with Oracle). I am happy to share this knowledge at various conferences, JUGs, in-house presentations and on my blog.","firstName":"Lukas","lastName":"Eder","photoLink":"LukasEder.jpg","priority":100,"shortBio":null,"talks":[{"class":"Talk","id":80}]},{"class":"pl.dworld.degree33.Speaker","id":3,"bio":"Vyacheslav Egorov is a software engineer at Google. He is primarily focused on technology behind virtual machines and compilers, first contributing to V8 JavaScript engine and then helping to create an optimizing compiler for the Dart VM. Before joining Google he worked on a Java VM with an ahead-of-time compiler at Excelsior LLC.","firstName":"Vyacheslav","lastName":"Egorov","photoLink":"VyacheslavEgorov.jpg","priority":100,"shortBio":"Software engineer at Google","talks":[{"class":"Talk","id":4},{"class":"Talk","id":7}]},{"class":"pl.dworld.degree33.Speaker","id":50,"bio":"Being a passionated Java developer with a deep commitment for Open Source software I am mostly interested in Performance Optimizations and understanding the internals of the JVM and the Garbage Collector. I love to bring software to it's limits by looking into profilers and finding problems inside of the codebase.\r\nIn addition I'm highly in interested in new ideas, technologies and new ways of solving problems. I have a deep understanding of IP based technologies like Protocol Stacks, TCP, UDP and asynchronous service implementations and fast serialization solutions.\r\nNormally I don't like to reinvent the wheel but I like to do so if there is a reason and a chance to make it faster or easier to use.","firstName":"Christoph","lastName":"Engelbert","photoLink":"ChristophEngelbert.jpg","priority":100,"shortBio":null,"talks":[{"class":"Talk","id":46}]},{"class":"pl.dworld.degree33.Speaker","id":20,"bio":"David Evans is an experienced agile consultant, coach and trainer with over 25 years of IT experience. A thought-leader in the field of agile testing, he has provided training and consultancy for clients in the UK, USA, Ireland, Sweden, Germany, France, Australia, Israel, South Africa and Singapore. A regular speaker at events and conferences across Europe, David was voted Best Speaker at Agile Testing Days 2012. He has also had several papers published in international IT journals. He currently lives and works in the UK, where he is a partner along with Gojko Adzic in Neuri Consulting LLP.","firstName":"David","lastName":"Evans","photoLink":"DavidEvans.jpg","priority":100,"shortBio":null,"talks":[{"class":"Talk","id":28}]},{"class":"pl.dworld.degree33.Speaker","id":24,"bio":"Volodymyr has over 8 years of experience in software development. Successfully led complex projects with small and middle teams, covering various aspects of software development, process and methodology.\r\nCurrently he’s working as Solution Architect for SoftServe company. He’s  been working with versatile projects, mainly it's Java and Ruby projects with different application architectures.\r\nAdditionally Volodymyr is experienced with video post-processing techniques such as: video quality measurement/enhancement, artifacts reduction etc., and has more than 10 publications on this area.","firstName":"Volodymyr","lastName":"Fedak","photoLink":"VolodymyrFedak.jpg","priority":100,"shortBio":null,"talks":[{"class":"Talk","id":76}]},{"class":"pl.dworld.degree33.Speaker","id":69,"bio":"Paweł is Agile-Lean trainer, coach and consultant with background in IT project management. He has seen many ways that didn’t work and has the courage to call them out when he observes them.\r\nPaweł gained experience in various professions starting from marketing research in a factory of chocolate, through chemical laboratory to air traffic control. He has practiced Scrum since 2006 starting as a team-member, Scrum Master, Agile project manager and finally a coach. He explored various levels of Agile coaching from helping build and grow self-organized teams to supporting Agile transformation and culture change.\r\nPaweł is an experienced trainer not only providing highly interactive workshops, but also working on comprehensive development programs tailored to the needs of their participants. Co-founder of Lean Leaders training initiative with the aim to build high-performing teams and organizations.\r\nPrivately, Paweł is a great fan of aviation, mountain trekking and creme brulee. At work, interested in making organizations Lean and teams Agile, Paweł will help you succeed with adaptive software development and show you how to make money with Scrum.","firstName":"Paweł","lastName":"Feliński","photoLink":"PawelFelinski.jpg","priority":100,"shortBio":null,"talks":[{"class":"Talk","id":95}]},{"class":"pl.dworld.degree33.Speaker","id":32,"bio":"Axel Fontaine is an entrepreneur, public speaker, software development expert and independent consultant based in Munich.\r\nHe specializes in Continuous Delivery and hates complexity with a passion.\r\nHe is the founder and the project lead of Flyway (flywaydb.org), the agile database migration framework for Java.\r\nHe regularly speaks at technical conferences.\r\nHe currently works on BoxFuse (boxfuse.com) to radically simplify the deployment of Java apps, by turning them into ultra-compact perfectly isolated secure VMs within seconds and deploying them on any hypervisor with a single command.\r\nYou can find him online at axelfontaine.com and on Twitter as @axelfontaine.","firstName":"Axel","lastName":"Fontaine","photoLink":"AxelFontaine.jpg","priority":100,"shortBio":null,"talks":[{"class":"Talk","id":69}]},{"class":"pl.dworld.degree33.Speaker","id":5,"bio":"Tim has been doing software engineering for almost 18 years, and has spent the last 8 years exclusively working in open source.\r\nTim is employed by Red Hat where he is the creator and project lead for Vert.x - the reactive, polyglot application platform.\r\nBefore creating Vert.x he spent several years leading messaging development at JBoss – in particular creating the HornetQ messaging system, which is at the heart of Wildfly (previously known as JBoss Application Server) and JBoss Enterprise Application Platform.\r\nTim also worked for a while with RabbitMQ at SpringSource, and was also one of the original core developers of the Mobicents telecommunication platform.\r\nTim lives in Somerset, UK with his family.","firstName":"Tim","lastName":"Fox","photoLink":"TimFox.jpg","priority":50,"shortBio":"Creator and project lead for Vert.x","talks":[{"class":"Talk","id":9}]},{"class":"pl.dworld.degree33.Speaker","id":16,"bio":"Tom Gilb and Kai Gilb have, together with many professional friends and clients, personally developed the methods they teach. The methods have been developed over decades of practice all over the world in both small companies and projects, as well as in the largest companies and projects. \r\nTom is the author of nine books, and hundreds of papers on these and related subjects. His latest book ‘Competitive Engineering’ is a substantial definition of requirements ideas. His ideas on requirements are the acknowledged basis for CMMI level 4 (quantification, as initially developed at IBM from 1980). Tom has guest lectured at universities all over UK, Europe, China, India, USA, Korea – and has been a keynote speaker at dozens of technical conferences internationally. \r\nThere are very many organizations and individuals who use some or all of their methods. IBM and HP were two early corporate adopters. Recently over 6,000 (and growing) engineers at Intel have adopted the Planguage requirements methods. Ericsson, Nokia and lately Symbian and A Major Mulitnational Finance Group use parts of their methods extensively. Many smaller companies also use the methods.","firstName":"Tom","lastName":"Gilb","photoLink":"TomGilb.jpg","priority":50,"shortBio":"Author of 9 books","talks":[{"class":"Talk","id":24},{"class":"Talk","id":86},{"class":"Talk","id":113}]},{"class":"pl.dworld.degree33.Speaker","id":79,"bio":"Experience from decades of practice from all over the world in both tiny companies with tiny projects, as well as in some of the worlds largest companies (like Ericsson and Nokia) and projects, is carefully incorporated through a relentless vision of excellence, farsightedness, clarity, efficiency, practicality and simplicity. \r\nKai Gilb, coach -managers, -product owners and -development teams, he lectures, develop and run workshops, he is writing a book - ‘Evo – Evolutionary Project Management & Product Development.’, he writes papers, develops online training workshops, is consulting worldwide, he assists project managers and teams during the projects startup, middle, delivery and maintenance phases and is called in to save projects that has gone astray. \r\nHis pro-bono activities are focused around all aspects of the Art of Living Foundation where he organizes courses and talks, he teaches and he enjoys himself. \r\nKai is also involved with other Environmental (EPA) and Third-World Aid charities or organizations.","firstName":"Kai","lastName":"Gilb","photoLink":"KaiGilb.jpg","priority":100,"shortBio":null,"talks":[{"class":"Talk","id":103}]},{"class":"pl.dworld.degree33.Speaker","id":77,"bio":"Konrad is a software engineer at IBM working in Kraków Software Lab. He has several years of experience working with IBM Cloud products leveraging OpenStack technology being responsible for multiple components and integration aspects covering both development and customer support activities. Konrad is a Java, JEE and various scripting languages programmer. He shares his ideas and participates in innovative projects or improvements. His potential is especially visible in the complex assignments based on the latest technology.","firstName":"Konrad","lastName":"Gorzelański","photoLink":"","priority":100,"shortBio":null,"talks":[]},{"class":"pl.dworld.degree33.Speaker","id":44,"bio":"Tugdual Grall is a Technical Evangelist at MongoDB, an open source advocate and a passionate developer. He currently works with the European developer communities and Mongo Partners to ease the NoSQL adoption.  \r\nBefore joining MongoDB, Tug was working as Technical Evangelist at Couchbase. Earlier Tug was CTO of eXo the company behind the revolutionary online development tools Cloud-IDE and the open source social platform eXo Platform. Earlier Tugdual has work as Product Manager and Developer on the Oracle Middleware focusing on Java EE platform.\r\nTugdual is Co-Founder of the Nantes JUG (Java User Group) that holds since 2008 monthly meeting about Java ecosystem. Tugdual also writes a blog available at  http://tugdualgrall.blogspot.com and available @tgrall","firstName":"Tugdual","lastName":"Grall","photoLink":"TugdualGrall.jpg","priority":100,"shortBio":null,"talks":[{"class":"Talk","id":53},{"class":"Talk","id":55}]},{"class":"pl.dworld.degree33.Speaker","id":54,"bio":"Seasoned Java developer, Team Leader and Solution Architect. In human language I’m: writing and reviewing\r\ncode, saving world with vim via ssh around Saturday midnights, deciding about technology used in the\r\nproject and ﬁlling a communication gap between client and developers.\r\nAfter 7 year long adventure with Java, still passionate about the platform, even after having romance with\r\nExcel and Outlook. Pragmatist at heart and propagator of Agile approach to building software.\r\nTricity JUG leader, conference speaker and blogger (recently on holidays)","firstName":"Michał","lastName":"Gruca","photoLink":"MichalGruca.jpg","priority":100,"shortBio":null,"talks":[{"class":"Talk","id":42}]},{"class":"pl.dworld.degree33.Speaker","id":26,"bio":"Gerrit Grunwald is a software engineer with more than eight years of experience in software development. He has been involved in Java desktop application and controls development. His current interests include JavaFX, HTML5, and Swing, especially development of custom controls in these technologies. Grunwald is also interested in Java-driven embedded technologies. He is a true believer in open source and has participated in popular projects like JFXtras.org as well as his own projects (Enzo, SteelSeries Swing, SteelSeries Canvas). Gerrit is an active member of the Java community, where he founded and leads the Java User Group Münster (Germany), he co-leads the JavaFX and IoT community, is a JavaOne rockstar and Java Champion. He is a speaker at conferences and user groups internationally.\r\n","firstName":"Gerrit","lastName":"Grunwald","photoLink":"GerritGrunwald.jpg","priority":100,"shortBio":null,"talks":[{"class":"Talk","id":74}]},{"class":"pl.dworld.degree33.Speaker","id":6,"bio":"Arun Gupta is Director of Developer Advocacy at Red Hat and focuses on JBoss Middleware. As a founding member of the Java EE team at Sun Microsystems, he spread the love for technology all around the world. At Oracle, he led a cross-functional team to drive the global launch of the Java EE 7 platform through strategy, planning, and execution of content, marketing campaigns, and program. After authoring ~1400 blogs at http://blogs.oracle.com/arungupta on different Java technologies, he continues to promote Red Hat technologies and products at blog.arungupta.me. Arun has extensive speaking experience in 37 countries on myriad topics and is a JavaOne Rockstar. An author of a best-selling book, an avid runner, a globe trotter, a Java Champion, he is easily accessible at @arungupta.","firstName":"Arun","lastName":"Gupta","photoLink":"ArunGupta.jpg","priority":30,"shortBio":"Java EE guru","talks":[{"class":"Talk","id":17},{"class":"Talk","id":11}]},{"class":"pl.dworld.degree33.Speaker","id":88,"bio":"Hi my name is Matt and I am a Developer Advocate. I help my colleagues to learn and embrace CI, CD, TDD, Developer Tools Ecosystem and Agile methodologies such as Scrum and Kanban. I am a full of energy extravert who tries to inspire other folks to share their knowledge and spread their passion.","firstName":"Matt","lastName":"Harasymczuk","photoLink":"MattHarasymczuk.jpg","priority":100,"shortBio":null,"talks":[{"class":"Talk","id":112}]},{"class":"pl.dworld.degree33.Speaker","id":62,"bio":"<p><a href=\"http://denisejacobs.com\">Denise R. Jacobs<\/a> is a Speaker + Writer + Creativity Evangelist who speaks at conferences worldwide and consults with companies and individuals, teaching techniques to make the creative process more fluid, methods for making work environments more conducive to creative productivity, and practices for sparking innovation. Working in Web Design &amp; Development since 1997, she is an industry veteran and regarded expert on many things web. Denise is the author of <a href=\"http://cssdetectiveguide.com/\">The CSS Detective Guide<\/a>, the premier book on troubleshooting CSS code; and co-authored <a href=\"https://shop.smashingmagazine.com/smashing-book-3-printed-and-or-ebook.html\">the Smashing Book #3: Redesign the Web<\/a> and <a href=\"http://interactwithwebstandards.com/\">InterAct with Web Standards: A holistic guide to web design<\/a>, and was nominated for .Net Magazine’s 2010 Best of the Web “Standards Champion” award. Denise has presented at events and organizations worldwide such as South By Southwest Interactive, the BBC, The Future of Web Design, Paris-Web, FITC: Future, Innovation, Technology, Creativity and TEDxRheinMain. From her own experience of embracing and expressing her creativity as well as helping hundreds of people do the same, she is passionate about evangelizing ways to enhance the ways we develop and execute ideas to make them tangible. Through her work, Denise shares big concepts that challenge the status quo and lead to “ahas” that translate into immediate actions, practices and skills to transform all aspects of people’s work lives with focused creativity.<\/p>","firstName":"Denise","lastName":"Jacobs","photoLink":"DeniseJacobs.jpg","priority":3,"shortBio":"Speaker, Writer and Creativity Evangelist","talks":[{"class":"Talk","id":87}]},{"class":"pl.dworld.degree33.Speaker","id":59,"bio":"Developer practicing software shamanism since 2005. Programming languages freak, recently blindfolded by functions. Sincere non-beliver to the agile liturgy. Mastered non-agreeing with everything to perfection. While you are reading this he’s probably playing with his son or refactoring his own code for 50th time, because “it still doesn’t feel right”.","firstName":"Jakub","lastName":"Janczak","photoLink":"JakubJanczak.jpg","priority":100,"shortBio":null,"talks":[{"class":"Talk","id":34}]},{"class":"pl.dworld.degree33.Speaker","id":71,"bio":"Software engineer hired for almost 8 years in IBM. Most experienced in Java, but for last 4 years working with JavaScript on daily basis. Mainly focused on Orion development, but also has committer rights in other Eclipse projects: Team, Compare and CVS. Has an MSc in Computer Science from University of Science and Technology (AGH) in Kraków. \r\nApart from programming enjoys driving small, vintage cars. ","firstName":"Małgorzata","lastName":"Janczarska","photoLink":"MalgorzataJanczarska.jpg","priority":100,"shortBio":null,"talks":[{"class":"Talk","id":106}]},{"class":"pl.dworld.degree33.Speaker","id":58,"bio":"Krzysztof is a software developer and an agile coach working at Pragmatists. He both keeps his technical abilities sharp and leans towards business side of software development to see the bigger picture. Passionately helps teams improve the way they collaborate and deliver. Recently he started a business of reselling great e-learnings on agile development practices at agile-elearning.pl.","firstName":"Krzysztof","lastName":"Jelski","photoLink":"","priority":100,"shortBio":null,"talks":[{"class":"Talk","id":81},{"class":"Talk","id":35}]},{"class":"pl.dworld.degree33.Speaker","id":86,"bio":"Ryan Knight is a consultant and trainer for Typesafe where he helps others learn and use Scala, Akka and Play. Ryan frequently does training and presentations at conferences around the world, such as JavaOne, Devoxx, and many other Java get–togethers. He has over 15 years of experience with enterprise software development. He first started consulting with Enterprise Java in 1999 with the Sun Java Center. Since then he has worked with a wide variety of companies, such as the Oracle, LDS Church, Williams Pipeline, Riot Games, Sony, T-Mobile, Deloitte and the State of Louisiana. This has given him experience with wide range of business, such as genealogy, telecommunications, finance and video games.","firstName":"Ryan","lastName":"Knight","photoLink":"RyanKnight.jpg","priority":100,"shortBio":null,"talks":[{"class":"Talk","id":50}]},{"class":"pl.dworld.degree33.Speaker","id":83,"bio":"Witold Kopel leads Cloud development  in Krakow software laboratory. His team, in collaboration with other IBM teams, is expanding IBM Cloud portfolio. In the past 8 years in IBM he led also teams working in the security compliance area. Witold Kopel holds a Master of Science in Computer Science.","firstName":"Witold","lastName":"Kopel","photoLink":"","priority":100,"shortBio":null,"talks":[{"class":"Talk","id":109}]},{"class":"pl.dworld.degree33.Speaker","id":34,"bio":"When I finished playing with code at university I took my baby steps in real word working on an airline system that processed thousands of transactions per second. There was no turning back and I become hooked on creating multithreaded, high volume and latency sensitive backend services. It turned out that these require as much profiling, optimizing and GC tuning as applying basic good design practices. Right now I work at a small polish startup company where I help create cloud based real time big data processing backend for our services. I like to explore JVM’s inner workings, GC algorithms and all things mechanical sympathy. I also believe that Java is not yet finished and I tried to prove it presenting lambda expressions on few conferences.","firstName":"Tomasz","lastName":"Kowalczewski","photoLink":"TomaszKowalczewski.jpg","priority":100,"shortBio":null,"talks":[{"class":"Talk","id":67}]},{"class":"pl.dworld.degree33.Speaker","id":42,"bio":"Włodek Krakowski has been a software craftsman for 13+ years. Recently he joined Lumesse in Krakow as an Application Architect and before this he spent 9 years in Sabre growing there from Junior to Team Lead Developer. During this time he was observing struggles of teams he belonged to with delivering software for clients. What he noticed was a “complaints approach” to many things (like delays, lack of TDD, good design) and putting responsibility for this onto the other side (business vs development). For some time he decided to focus on “what I can do to change it”. As he is developer he focused on teaching people refactoring code what was his role for the last 2 year. He focused on refactoring with given goal, not refactoring for refactoring. The goals were different : extendibility, separation of concerns, testability, maintainability or just readability which is core of each software but always with “the end in mind”.","firstName":"Włodek","lastName":"Krakowski","photoLink":"WlodzimierzKrakowski.jpg","priority":100,"shortBio":null,"talks":[{"class":"Talk","id":57}]},{"class":"pl.dworld.degree33.Speaker","id":36,"bio":"Jakub is a software developer for whom coding is a way of life as well as a hobby. Focused on slimming enterprise class systems, strongly interested in new technologies and continuously improving the software delivery process. His great passion are lightweight applications, in which the ratio of provided functionality to the code is as smallest as possible. Co-founder of the agile software house Codearte. Confitura conference organizer.","firstName":"Jakub","lastName":"Kubryński","photoLink":"","priority":100,"shortBio":null,"talks":[{"class":"Talk","id":63}]},{"class":"pl.dworld.degree33.Speaker","id":14,"bio":"Roland Kuhn is leading the Akka project at Typesafe, a co-author of the Reactive Manifesto, co-teaching the Coursera course “Principles of Reactive Programming” and a passionate open-source hakker. He also holds a PhD in particle physics and has worked in the space industry for several years. See also rolandkuhn.com.","firstName":"Roland","lastName":"Kuhn","photoLink":"RolandKuhn.jpg","priority":80,"shortBio":"Akka Lead at Typesafe","talks":[{"class":"Talk","id":22}]},{"class":"pl.dworld.degree33.Speaker","id":47,"bio":"Jacek is a newcomer to Scala with few Scala gigs under his belt. He runs a Scala project - scalania - on GitHub that gave birth Scala meetings in Warsaw, Poland and eventually @WarszawScaLa - a Scala user group. He builds his reputation in SBT answering questions about the build tool on StackOverflow and contributes to the project on GitHub.","firstName":"Jacek","lastName":"Laskowski","photoLink":"JacekLaskowski.jpg","priority":100,"shortBio":null,"talks":[{"class":"Talk","id":49}]},{"class":"pl.dworld.degree33.Speaker","id":19,"bio":"Ben Lavender has been developing for more than 15 years in a wide variety of languages and organizations, from startups to enterprise consulting. He currently works on internal tools and workflow automation for GitHub. In his spare time, he organizes New Orleans' weekly programming meetup.","firstName":"Ben","lastName":"Lavender","photoLink":"","priority":100,"shortBio":null,"talks":[{"class":"Talk","id":27}]},{"class":"pl.dworld.degree33.Speaker","id":45,"bio":"Kim Leppänen is a Vaadin Expert, working closely together with clients, solving problems and helping clients create business applications. Kim has been working with web technologies for over a decade and during the years he has developed a special interest in web application security.","firstName":"Kim","lastName":"Leppänen","photoLink":"","priority":100,"shortBio":null,"talks":[{"class":"Talk","id":52}]},{"class":"pl.dworld.degree33.Speaker","id":76,"bio":"Marcin Lewandowski is a software engineer and architect, working for IBM in Poland Software Labs in Kraków. With over 10 years of expertise in various software projects, he currently works on technical direction of key Cloud products in IBM portfolio. Even though he is in need to work across various technologies from Bash to CSS, Java in all it's forms is still closest to his heart. \r\nBeing and active IBM community code contributor from the very beginning, Marcin is very keen on working with emerging technologies, trying to advocate them whenever and wherever possible. His passion on Eclipse and OpenStack open technologies resulted already in a couple of presentations for the Kraków-wide technical community.","firstName":"Marcin","lastName":"Lewandowski","photoLink":"","priority":100,"shortBio":null,"talks":[{"class":"Talk","id":101}]},{"class":"pl.dworld.degree33.Speaker","id":73,"bio":"Josh Long is the Spring developer advocate at Pivotal (http://gopivotal.com). Josh is the lead author on 4 books and instructor in one of Safari's best-selling video series, all on Spring. Josh likes solutions that push the boundaries of the technologies that enable them. His interests include cloud-computing, business-process management, big-data and high availability, mobile computing and smart systems. He blogs on https://spring.io/team/jlong or on his personal blog and on Twitter (@starbuxman).","firstName":"Josh","lastName":"Long","photoLink":"JoshLong.jpg","priority":100,"shortBio":null,"talks":[{"class":"Talk","id":99}]},{"class":"pl.dworld.degree33.Speaker","id":82,"bio":"Software developer at CollabNet, located in Berlin, OpenSource enthusiast and long time Linux user. Contributes to EGit, Gerrit, JGit and TestNG projects.\r\nIn his day to day work integrates CollabNet TeamForge with Gerrit. Strongly involved in core Gerrit development around its plugability. Conference speaker, motorbike rider and runner.\r\nFrom time to time share his thoughts on http://luksza.org/. Recently started new blog (in Polish) about Java http://javablog.pl/.","firstName":"Dariusz","lastName":"Luksza","photoLink":"DariuszLuksza.jpg","priority":100,"shortBio":null,"talks":[{"class":"Talk","id":107}]},{"class":"pl.dworld.degree33.Speaker","id":56,"bio":"Kito D. Mann is the Principal Consultant at Virtua, Inc., specializing in enterprise application architecture, training, development, and mentoring with JavaServer Faces, portlets, Liferay, and Java EE technologies. He is also the editor-in-chief of JSFCentral.com (www.jsfcentral.com), co-host of the Enterprise Java Newscast (http://blogs.jsfcentral.com/JSFNewscast/category/Newscasts), host of the JSF Podcast interview series (http://www.jsfcentral.com/resources/jsfcentralpodcasts/), and the author of JavaServer Faces in Action (Manning). Mann has participated in several Java Community Process expert groups (including JSF and Portlets) and is also an internationally recognized speaker. He holds a BA in Computer Science from Johns Hopkins University.\r\n","firstName":"Kito","lastName":"Mann","photoLink":"","priority":100,"shortBio":null,"talks":[{"class":"Talk","id":38},{"class":"Talk","id":39},{"class":"Talk","id":37}]},{"class":"pl.dworld.degree33.Speaker","id":57,"bio":"Jakub has been around software development for past 10 years, wearing multiple hats, getting hands dirty in multiple environments, securing both technical as well as the business side of The Thing. “An engineer with a human friendly interface?”. Some languages, some frameworks, blah blah blah - doesn’t matter. \r\nJakub always considered programming as a tool to solve real-life problems - in a pragmatic way. He always stayed closed to business side of the solution, still focusing on the technology. He combines daily job of managing a horde of software engineers at Young Digital Planet with lectures and technical trainings and commitment to Gdańsk Java User Group.","firstName":"Jakub","lastName":"Marchwicki","photoLink":"JakubMarchwicki.jpg","priority":100,"shortBio":null,"talks":[{"class":"Talk","id":36}]},{"class":"pl.dworld.degree33.Speaker","id":68,"bio":"Dani is one of the initial Eclipse committers. Currently he leads the Platform and the JDT projects. He is a member of the Eclipse Project PMC and represents the Eclipse project in the Planning Council. Dani worked at OTI and now works at IBM Research GmbH. His interests include user interface and API design, editors, software quality and performance.","firstName":"Daniel","lastName":"Megert","photoLink":"","priority":100,"shortBio":null,"talks":[{"class":"Talk","id":94}]},{"class":"pl.dworld.degree33.Speaker","id":18,"bio":"Damian is a Senior Software Engineer at Evernote, based out of Geneva, Switzerland.  He created the original Evernote Windows Phone client, and worked on Evernote Food for Android, and is now focused on Evernote and wearable technology.  He created the Evernote apps for the Samsung Galaxy Gear and the Pebble smartwatch.\r\nPrior to joining Evernote, Damian released an app he'd created in his spare time, which used Evernote's open API.  Evernote noticed, and he got a call from the CEO asking if he'd join the company to help build Evernote's next generation of products.  It wasn't a hard decision.\r\nHe has founded and eventually sold several successful software product companies, and loves the magic that is programming: turning something imagined into something real.","firstName":"Damian","lastName":"Mehers","photoLink":"DamianMehers.jpg","priority":100,"shortBio":"Senior Software Engineer at Evernote","talks":[{"class":"Talk","id":26}]},{"class":"pl.dworld.degree33.Speaker","id":33,"bio":"Luca Milanesio is the co-founder of GerritForge (http://www.gerritforge.com) and has more than 20 year of Software Development and Application Lifecycle Management experience. He is contributor of Jenkins CI project (www.jenkins-ci.org), Gerrit code-review (http://code.google.com/p/gerrit/) and co-founder of the Mobile Client project for Jenkins CI (http://www.jenkins-ci.mobi).\r\nLuca is an enthusiast developer and contributor of Git and Gerrit; fuelled innovation in large enterprises in Northern Europe and Canada by introducing them in the company code-lifecycle alongside with tools and technologies.\r\nHe moved to London UK and founded his own company (http://www.lmitsoftware.com) to actively support all the technologies behind Agile ALM, from SCM, issue-tracking, continuous integration and code-review.","firstName":"Luca","lastName":"Milanesio","photoLink":"LucaMilanesio.jpg","priority":100,"shortBio":null,"talks":[{"class":"Talk","id":108},{"class":"Talk","id":68}]},{"class":"pl.dworld.degree33.Speaker","id":63,"bio":"Mike Milinkovich has been involved in the software industry for over thirty years, doing everything from software engineering, to product management to IP licensing. His primary experience in open source has been as the Executive Director of the Eclipse Foundation since 2004. In that role he is responsible for supporting both the Eclipse open-source community and its commercial ecosystem.  Prior to joining Eclipse, Mike was a vice president in Oracle’s development group. Other stops along the way include WebGain, The Object People, IBM, Object Technology International (OTI) and Nortel.\r\nMike sits on the Board of the Open Source Initiative (OSI), on the Executive Committee of the Java Community Process (JCP), and is an observer and past member of the Board of OpenJDK.\r\nMike earned his Masters of Science degree in Information and Systems Sciences and a Bachelor of Commerce degree from Carleton University. He lives in Ottawa, Canada.\r\n","firstName":"Mike","lastName":"Milinkovich","photoLink":"MikeMilinkovich.jpg","priority":4,"shortBio":"Executive Director of the Eclipse Foundation","talks":[{"class":"Talk","id":88},{"class":"Talk","id":89}]},{"class":"pl.dworld.degree33.Speaker","id":9,"bio":"Ted Neward is an independent consultant specializing in high-scale enterprise systems, working with clients ranging in size from Fortune 500 corporations to small 20-person shops. He speaks on the conference circuit, including the No Fluff Just Stuff Symposium tour, discussing Java, .NET and XML service technologies, focusing on Java-.NET interoperability. He has written several widely-recognized books in both the Java and .NET space, including the recently-released “Effective Enterprise Java”. He lives in the Pacific Northwest with his wife, two sons, four video-game consoles, thousands of books (on programming and otherwise), and eight PCs.","firstName":"Ted","lastName":"Neward","photoLink":"TedNeward.jpg","priority":8,"shortBio":"Independent consultant and Java geek","talks":[{"class":"Talk","id":16},{"class":"Talk","id":15},{"class":"Talk","id":84}]},{"class":"pl.dworld.degree33.Speaker","id":30,"bio":"Spent half of his life on programming, for the last 7 years professionally in Java land. Loves back-end, tolerates JavaScript. Passionate about alternative JVM languages. Disappointed with the quality of software written these days (so often by himself!), hates long methods and hidden side effects. Interested in charting, data analysis and reporting. Technical reviewer of \"Learning Highcharts\" and \"Getting started with IntelliJ IDEA\". Believes that computers were invented so that developers can automate boring and repetitive tasks. Also their own.\r\nOn a daily basis writes in functional languages for financial sector. Crew member of scala.net.pl, involved in open-source. DZone's Most Valuable Blogger (http://nurkiewicz.blogspot.com), used to be very active on StackOverflow, best speaker of last Confitura conference according to attendees.\r\nLikes programming. Claims that code not tested automatically is not a feature but just a rumor.","firstName":"Tomasz","lastName":"Nurkiewicz","photoLink":"TomaszNurkiewicz.jpg","priority":100,"shortBio":null,"talks":[{"class":"Talk","id":70}]},{"class":"pl.dworld.degree33.Speaker","id":67,"bio":"In software development since 1995, worked on banking systems, J2EE enterprise apps, telecommunication systems and even industrials robots. Primarily interested in low level Linux programming and high performance computing. Currently working for IBM Research on modern networking solutions. ","firstName":"Piotr","lastName":"Padkowski","photoLink":"","priority":100,"shortBio":null,"talks":[{"class":"Talk","id":93}]},{"class":"pl.dworld.degree33.Speaker","id":28,"bio":"Pratik Patel is the CTO of Atlanta based TripLingo (http://www.triplingo.com/). He wrote the first book on 'enterprise Java' in 1996, \"\"Java Database Programming with JDBC.\"\" He has also spoken at various conferences and participates in several local tech groups and startup groups. He's in the startup world now and hacks iOS, Android, HTML5, CSS3, JavaScript, Rails, and ..... well everything except Perl.\r\nPratik's specialty is in large-scale applications for mission-critical and mobile applications use. He has designed and built applications in the retail, health care, financial services, and telecoms sectors. Pratik holds a master's in Biomedical Engineering from UNC, has worked in places such as New York, London, and Hong Kong, and currently lives in Atlanta, GA.","firstName":"Pratik","lastName":"Patel","photoLink":"PratikPatel.jpg","priority":100,"shortBio":null,"talks":[{"class":"Talk","id":73},{"class":"Talk","id":72}]},{"class":"pl.dworld.degree33.Speaker","id":25,"bio":"Raquel is a full-stack Software Engineer at DAMA-UPC and Walkmod Product Lead. Every single day she works with software developers helping them dealing with legacy code and software architecture. Professional interests include programming languages, middleware and tooling. Java enthusiast, maven fan, Eclipse addict, Raquel has being involved in multiple, both commercial and research projects. In those projects, she has gained a bast experience in NoSQL technologies, social networks analytics, recommendation systems and deduplication algorithms.","firstName":"Raquel","lastName":"Pau","photoLink":"RaquelPau.jpg","priority":100,"shortBio":null,"talks":[{"class":"Talk","id":75}]},{"class":"pl.dworld.degree33.Speaker","id":39,"bio":"I have spent last 15 years of my life in IT working as database and system administrator, developer, architect, manager and \"on site disaster engineer \". At the moment I work as chief architect in Lumesse, European HR SaaS  solution provider.\r\nI was involved in small, medium and horribly and nonsense large systems, from \"waterfall\" through Agile to \"no methodology\" methodology. It all lead me to conclusion that it doesn't matter what you do as long as you do it right, keep it simple and use the right tool to do the job for you. In the meantime I fell in love it TDD, Software Craftmanship and beautiful and simple ideas like REST, JavaScript and NOSQL. I also spent a lot of time exploring ideas like system thinking, system dynamics, strange attractor and complexity theory. From time to time you can hear my low quality jokes about architecture at conferences in Poland. I am also trying to make a world a better place as member of SSEEP and blog author at http://geekyprimitives.com.","firstName":"Jarosław","lastName":"Pałka","photoLink":"JaroslawPalka.jpg","priority":100,"shortBio":null,"talks":[{"class":"Talk","id":61}]},{"class":"pl.dworld.degree33.Speaker","id":4,"bio":"Mary Poppendieck has been in the Information Technology industry for over thirty years. She has managed software development, supply chain management, manufacturing operations, and new product development. She spearheaded the implementation of a Just-in-Time system in a 3M video tape manufacturing plant and led new product development teams, commercializing products ranging from digital controllers to 3M Light Fiber™.\r\nMary has pioneered the application of Lean Thinking to software development and documented their principles in books: Lean Software Development: An Agile Toolkit, published in 2003, its sequel, Implementing Lean Software Development: From Concept to Cash, published in 2006, Leading Lean Software Development: Results are Not the Point in 2009, and The Lean Mindset: Ask the Right Questions in 2013.\r\nFor the last several years she is helping companies around the world implementing Lean principles by providing lectures, training and coaching.","firstName":"Mary","lastName":"Poppendieck","photoLink":"MaryPoppendieck.jpg","priority":4,"shortBio":"Lean Software Development  pioneer","talks":[{"class":"Talk","id":83},{"class":"Talk","id":21},{"class":"Talk","id":8}]},{"class":"pl.dworld.degree33.Speaker","id":13,"bio":"Tom Poppendieck has over 25 years of experience in computing including eight years of work with object technology. His modeling and mentoring skills are rooted in his experience as a physics professor. His early work was in IT infrastructure, product development, and manufacturing support, and evolved to consulting project assignments in healthcare, logistics, mortgage banking, and travel services. Tom holds a PhD in Physics and has taught physics for ten years.","firstName":"Tom","lastName":"Poppendieck","photoLink":"","priority":100,"shortBio":null,"talks":[]},{"class":"pl.dworld.degree33.Speaker","id":49,"bio":"I am Java Developer since 1999. I love programming since my first line of code I did on C64  in Basic. I have 14 Years experience s developing JEE software working for various companies and projects. For last 3 years I am working at Capgemini in Wroclaw as Technical Architect.\r\nI do design, lead teams and provide coaching and training inside company. I like to present my experience in public (Wroclaw JUG, DevCrowd 2013 , Akademia Capgemini, Capgemini Tech Talks).  \r\nI like to do shows - presenting the things just as they work – with live coding, demos and hacking.  So: expect everything but the boring slideshow.\r\n","firstName":"Jarek","lastName":"Ratajski","photoLink":"JaroslawRatajski.jpg","priority":100,"shortBio":null,"talks":[{"class":"Talk","id":45}]},{"class":"pl.dworld.degree33.Speaker","id":72,"bio":"Krzysztof Ras is a Software Development Director at Luxoft, a global leader in offshore software development and IT outsourcing company. Responsible for end to end delivery as the head of two software development departments with 100+ specialists onboard working in multiple scrum teams located in different geographical locations. He joined Luxoft Poland upon its start of operations in Poland in Oct 2010 and helped the company to set up and grow up to 370+ HC as of Jan 2014 by building high performance teams and defining strategic direction and roadmap.  Also, serving as a Scrum Master and Project Management trainer delivering trainings on project management, Scrum/Agile, estimations within and outside the company.\r\n<a href=\"http://www.linkedin.com/in/krzysztofras\">LinkedIn profile<\/a>\r\n","firstName":"Krzysztof","lastName":"Raś","photoLink":"KrzysztofRas.jpg","priority":100,"shortBio":null,"talks":[{"class":"Talk","id":98}]},{"class":"pl.dworld.degree33.Speaker","id":48,"bio":"Abdel is a software developer and technology enthusiast at heart and by profession. Particularly interested in large distributed systems and enterprise software architecture in general. An active open-source advocate and contributor. President and Founder of a number of organizations namely The NorCal Java User Group, and The Silicon Valley Dart Meetup. Abdel is a JavaOne RockStar and a frequent speaker at a number of developer conferences including JavaOne, JAX Conf, OsCon, OREDEV, 33rd Degree and many user groups and community events.","firstName":"Abdelmonaim","lastName":"Remani","photoLink":"AbdelRemani.jpg","priority":100,"shortBio":null,"talks":[{"class":"Talk","id":47},{"class":"Talk","id":48},{"class":"Talk","id":85}]},{"class":"pl.dworld.degree33.Speaker","id":11,"bio":"Simon Ritter is a Java Technology Evangelist at Oracle Corporation. Simon has been in the IT business since 1984 and holds a Bachelor of Science degree in Physics from Brunel University in the U.K.\r\nOriginally working in the area of UNIX development for AT&T UNIX System Labs and then Novell, Simon moved to Sun in 1996. At this time he started working with Java technology and has spent time working both in Java technology development and consultancy. Having moved to Oracle as part of the Sun acquisition he now specialises in looking at emerging technologies including cloud computing, wireless sensor networks, and gestural interfaces.","firstName":"Simon","lastName":"Ritter","photoLink":"SimonRitter.jpg","priority":100,"shortBio":"Java MacGyver","talks":[{"class":"Talk","id":29}]},{"class":"pl.dworld.degree33.Speaker","id":74,"bio":"Software engineer at IBM in the Eclipse Platform UI team. He has been working as software developer for more than 9 years. \r\nDuring this period he participated in different projects using various programming languages as well as technologies. \r\nCurrently he concentrates mainly on Java and Java related open-source frameworks ","firstName":"Daniel","lastName":"Rolka","photoLink":"DanielRolka.jpg","priority":100,"shortBio":null,"talks":[{"class":"Talk","id":100}]},{"class":"pl.dworld.degree33.Speaker","id":38,"bio":"Daniel Sawano is a consultant and developer at Omegapoint. Daniel has a M.Sc. in Electrical Engineering and Computer Science and has been a Java developer for more than 12 years. His main focus is highly transactional and distributed systems. Daniel is passionate about beautiful code, systems design and most things related to cloud.","firstName":"Daniel","lastName":"Sawano","photoLink":"DanielSawano.jpg","priority":100,"shortBio":null,"talks":[{"class":"Talk","id":60}]},{"class":"pl.dworld.degree33.Speaker","id":15,"bio":"Wojciech Seliga is a seasoned software developer and entrepreneur. He started coding 30 years ago and since then has witnessed various waves, hypes and fashions in our industry. He has been responsible for fostering agile practices in the development and business alike, managing and staffing software projects and mentoring.\r\nCurrently he runs a company he co-founded – Spartez - which partners with Atlassian on developing their core products. Besides leading efforts around Atlassian JIRA, Wojciech contributed to several open source projects and is an author of ScreenSnipe – a commercial cross-platform screenshotting tool sold globally.\r\nWojciech was presenting at many international conferences including Devoxx, Agile, EclipseCon, Javarsovia/Confitura, 33rd Degree, Atlassian Summit, AtlasCamp, AgileByExample, GeeCon, InfoSHARE and smaller technical/business events in Poland and abroad.","firstName":"Wojciech","lastName":"Seliga","photoLink":"WojciechSeliga.jpg","priority":100,"shortBio":null,"talks":[{"class":"Talk","id":23}]},{"class":"pl.dworld.degree33.Speaker","id":23,"bio":"Od ponad dziesięciu lat profesjonalnie zajmuje się tworzeniem oprogramowania. Zdobyte w tym czasie doświadczenie przenosi na pole zawodowe w BNS IT, gdzie jako trener i konsultant, współpracuje z jednymi z najlepszych polskich zespołów programistycznych. Jego obszary specjalizacji to: czysty kod oraz technical leadership. Prowadzenie szkoleń, liczne publikacje w obszarze IT, badania czynników sukcesów projektów programistycznych, są pasją, w której, podobnie jak w życiu, kieruje się zasadą, że człowiek jest najważniejszy.\r\n","firstName":"Mariusz","lastName":"Sieraczkiewicz","photoLink":"MariuszSieraczkiewicz.jpg","priority":100,"shortBio":null,"talks":[{"class":"Talk","id":77}]},{"class":"pl.dworld.degree33.Speaker","id":22,"bio":"Trener, konsultant specjalizujący się w technologiach Java EE i efektywnym wykorzystaniu zdobyczy inżynierii oprogramowania. \r\nDo jego zainteresowań należy szeroko pojęta inżynieria oprogramowania: architektury wysokowydajnych systemów webowych (w szczególności CqRS), modelowanie (w szczególności DDD), wzorce, zwinne procesy wytwórcze. Hobbystycznie interesuje się psychologią i kognitywistyką. \r\nEntuzjasta Software Craftsmanship. \r\nW wolnych chwilach działa w community jako: prezes Stowarzyszenia Software Engineering Professionals Polska, publicysta w prasie branżowej i blogger.","firstName":"Sławek","lastName":"Sobótka","photoLink":"SlawomirSobotka.jpg","priority":100,"shortBio":null,"talks":[{"class":"Talk","id":78},{"class":"Talk","id":79}]},{"class":"pl.dworld.degree33.Speaker","id":1,"bio":"Daniel Steinberg has spent the last three decades programming the iPad and iPhone. OK, he hasn't. But he's been programming the iPhone and the iPad since the SDK's first appeared in beta and Mac OS X for many years before. Daniel is the author of the book iPad and iPhone App Development, the official companion book to the popular iTunes U series from Stanford University taught by Paul Hegarty in Fall 2011.\r\nDaniel presents iPhone and Cocoa training for the Pragmatic Studio and consults through his company Dim Sum Thinking. When he's not coding or talking about coding for the Mac, the iPhone, and the iPad he's probably cooking or hanging out with his wife and daughter.","firstName":"Daniel","lastName":"Steinberg","photoLink":"DanielSteinberg.jpg","priority":5,"shortBio":"iPhone and iPad book author","talks":[{"class":"Talk","id":2},{"class":"Talk","id":3},{"class":"Talk","id":1}]},{"class":"pl.dworld.degree33.Speaker","id":10,"bio":"Dr. Venkat Subramaniam, founder of Agile Developer, Inc., has trained and mentored thousands of software developers in the US, Canada, Europe, and Asia. Venkat helps his clients effectively apply and succeed with agile practices on their software projects, and speaks frequently at international conferences and user groups. He is author of \".NET Gotchas,\" coauthor of 2007 Jolt Productivity Award winning \"Practices of an Agile Developer,\" author of \"Programming Groovy: Dynamic Productivity for the Java Developer\" and \"Programming Scala: Tackle Multi-Core Complexity on the Java Virtual Machine\" (Pragmatic Bookshelf).","firstName":"Venkat","lastName":"Subramaniam","photoLink":"VenkatSubramaniam.jpg","priority":1,"shortBio":"Truely polyglot developer, best speaker at 33rd Degree 2011, 2012 and 2013","talks":[{"class":"Talk","id":32},{"class":"Talk","id":30},{"class":"Talk","id":31}]},{"class":"pl.dworld.degree33.Speaker","id":75,"bio":"Wojciech Sudoł is a software developer at IBM in the Eclipse Platform UI team. He has been working as a software engineer for 6 years taking roles of a tester, test automation leader and developer, working mostly with Java related projects.","firstName":"Wojciech","lastName":"Sudoł","photoLink":"","priority":100,"shortBio":null,"talks":[]},{"class":"pl.dworld.degree33.Speaker","id":78,"bio":"Ken Walker is the lead for both the Open Source Orion project and the Web IDE within Jazzhub. He aims to make web-based development tools match and exceed the capabilities of a desktop IDE and not just for web applications. His work in developer tools includes a long history from ENVY/Smalltalk, VisualAge for Java, VisualAge Micro Edition, Eclipse and now the JavaScript based client-side Orion platform. Ken lead IBM’s J9 JVM Class Library team writing open-sourced implementations of the Java Specifications and worked on embedded implementations from mobile phones, set top boxes, entertainment consoles and telematics.","firstName":"Ken","lastName":"Walker","photoLink":"KenWalker.jpg","priority":100,"shortBio":null,"talks":[{"class":"Talk","id":102},{"class":"Talk","id":91}]},{"class":"pl.dworld.degree33.Speaker","id":37,"bio":"He wrote his first line of code in 1993. Since then, a lot has changed in the software development world, but great majority of us didn't notice that.\r\nHe creates software professionally since 2005. During that time he worked in small companies, big corporations and he even launched two startups.\r\nFor over four years he is proactively interrested in complex domains modeling (Domain-Driven Design) and writes about it on his blog  : http://www.eventuallyinconsistent.com .\r\nHe is a founder of meetup group for Domain-Driven Desingers in Kraków (http://www.meetup.com/DDD-KRK/), active member of SCKRK (http://www.meetup.com/sc-krk), initiator and organizer of #cqrsbeers meetings in Kraków and a member of SSEPP (http://ssepp.pl). He lives and works in Kraków.","firstName":"Piotr","lastName":"Wyczesany","photoLink":"PiotrWyczesany.jpg","priority":100,"shortBio":null,"talks":[{"class":"Talk","id":62}]},{"class":"pl.dworld.degree33.Speaker","id":84,"bio":"Michal Zarakowski is a software engineer, working in IBM Krakow Software Lab. After 6 years in the security area, working on both threat detection systems and well as on compliance checking content, Michal moved to cloud-oriented software pillar. Beside cloud solutions developed by IBM he is working on leveraging the rapidly progressing OpenStack technology in Java based products.","firstName":"Michał","lastName":"Zarakowski","photoLink":"","priority":100,"shortBio":null,"talks":[]},{"class":"pl.dworld.degree33.Speaker","id":80,"bio":"Tomasz is a software developer at Tasktop Technologies. He is located in Krakow, Poland. Prior to joining Tasktop, he spent over 5 years with a team working on the Eclipse Platform. He was also involved in the Eclipse Orion project and fixed a bunch of bugs in JDT. He is now a committer on the Mylyn project, one of the most popular project for Eclipse. After hours he squashes pesky bugs in EGit (as a committer) and JGit (as an active contributor).","firstName":"Tomasz","lastName":"Zarna","photoLink":"TomaszZarna.jpg","priority":100,"shortBio":null,"talks":[{"class":"Talk","id":104}]},{"class":"pl.dworld.degree33.Speaker","id":46,"bio":"Stefan Zeiger is the tech lead for Slick. He joined Typesafe in 2011 after developing ScalaQuery, the predecessor to Slick, in order to work on the new project full-time. He has been a user of Java and the JVM platform professionally since 1996, working on a diverse range of projects from web servers to GUI frameworks and programming language design, and moving on from Java to Scala since 2008.\r\nTwitter: @StefanZeiger\r\nGithub: https://github.com/szeiger/","firstName":"Stefan","lastName":"Zeiger","photoLink":"StefanZeiger.jpg","priority":100,"shortBio":null,"talks":[{"class":"Talk","id":51}]},{"class":"pl.dworld.degree33.Speaker","id":60,"bio":"Leif Åstrand is working full-time with developing and maintaining the Vaadin framework. He has been heavily involved in conceiving, designing and implementing many of the new features in Vaadin 7 and subsequent minor releases. Areas of special expertise related to Vaadin includes the client-side architecture, the communication layer and GWT in general. Previous experience include working in a web analytics startup and a small web agency.","firstName":"Leif","lastName":"Åstrand","photoLink":"LeifAstrand.jpg","priority":100,"shortBio":null,"talks":[]}]